src/main/resources/payhost/vault/DeleteVaultRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
   xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:ns1="http://www.paygate.co.za/PayHOST"
   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
   SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
   <SOAP-ENV:Body>
<ns1:SingleVaultRequest>
    <ns1:DeleteVaultRequest>
        <ns1:Account>
            <ns1:PayGateId>{PayGateId}</ns1:PayGateId>
            <ns1:Password>{Password}</ns1:Password>
        </ns1:Account>
        <ns1:VaultId>{VaultId}</ns1:VaultId>
    </ns1:DeleteVaultRequest>
</ns1:SingleVaultRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
             
             